Repository: allee15/Artists-s-land
Catalog: ArtistsLand/Localizable.xcstrings
Source language: en
Languages: ro

source: Access your Artist's land account
ro: Accesează-ți contul Artist's Land.

source: Account
ro: Cont

source: Account type
ro: Tipul contului

source: Activate two factor authentication
ro: Activează autentificarea în doi pași.

source: An error has occured. Please try again!
ro: A apărut o eroare. Te rugăm să încerci din nou!

source: Buy tokens, level up and increase the chances for your posts to appear the firsts on feed.
ro: Cumpără tokenuri, crește-ți nivelul și mărește șansele ca postările tale să apară primele în feed.

source: Choose a new password. Note that it should be at least 6 characters.
ro: Alege o parolă nouă. Reține că trebuie să aibă cel puțin 6 caractere.

source: Comments section
ro: Secțiunea de comentarii

source: Deactivate two factor authentication
ro: Dezactivează autentificarea în doi pași.

source: For each 5 tokens bought, you'll advance 10 points in level.
ro: Pentru fiecare 5 tokenuri cumpărate, vei avansa cu 10 puncte în nivel.

source: Gender
ro: Statut

source: Glad to see you! 👋 Enter your details below and access your account.
ro: Bine te-am găsit! 👋 Introdu detaliile de mai jos și accesează-ți contul.

source: I read and agree to
ro: Am citit și sunt de acord cu

source: Language
ro: Limbă

source: Let’s create your account
ro: Să-ți creăm contul

source: Level: %lld
ro: Nivel: %lld

source: Login
ro: Autentificare

source: No chats available. Start a new one!
ro: Nu sunt disponibile conversații. Începe una nouă!

source: Please enter a phone number in order to activate 2 factor-authentication. Note that we will not share your phone number with anyone else.
ro: Te rugăm să introduci un număr de telefon pentru a activa autentificarea în doi pași. Ține cont că nu vom împărtăși numărul tău de telefon cu nimeni altcineva.

source: Please enter your details below
ro: Te rugăm să introduci detaliile tale mai jos.

source: Please login to enjoy the full experience of ArtistsLand app!
ro: Te rugăm să te autentifici pentru a te bucura de întreaga experiență a aplicației ArtistsLand!

source: Settings
ro: Setări

source: The Terms and Conditions
ro: Termenii și condițiile

source: Tokens:
ro: Tokenuri:

source: Version
ro: Versiune

source: Your balance: %@
ro: Soldul tău: %@

source: Your balance: %lld
ro: Soldul tău: %lld
